In [ ]:
%load_ext sql

In [ ]:
%sql sqlite:///stud_db

In [ ]:
%sql SET SQL_SAFE_UPDATES = 0;

 * sqlite:///stud_db
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET SQL_SAFE_UPDATES = 0;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [ ]:
%%sql
CREATE TABLE personal_details (
national_ID INTEGER(15) , stud_ID VARCHAR(15),stud_name VARCHAR(100),
phone_number VARCHAR(15),age INTEGER, gender VARCHAR(10),
PRIMARY KEY(national_ID) );

 * sqlite:///stud_db
Done.

[]

In [ ]:
%%sql
INSERT INTO personal_details (national_ID,stud_ID,stud_name,phone_number,age,gender)
VALUES("344534","stud101","Hermione Granger" ,"0712345678",20,"Male"),
("379683","stud102","Draco Malfo" ,"0723456781",21,"Female"),
("347403","stud103","Jayden Wamashati" ,"0734567812",22,"Male"),
("377302","stud104","Ron Weasley" ,"0745678123",19,"Female"),
("336741","stud105","Dolores Umbridge" ,"0756781234",21,"Male"),
("307243","stud106","Hedwig Tonks" ,"0767812345",21,"Female"),
("310932","stud107","Chao Chang" ,"0778123456",22,"Male"),
("343920","stud108","Curfew Yaeitpm" ,"0781234567",20,"Female"),
("345261","stud109","Chaptr Mukenya" ,"0722345678",20,"Male"),
("339152","stud110","Natalie Mpema" ,"0733456781",21,"Female"),
("339746","stud111","Crew Nundi" ,"0744567812",20,"Male"),
("336373","stud112","Bandi Kagunda" ,"0755678123",22,"Female"),
("325252","stud113","Testimony Omolo" ,"0766456781",21,"Male"),
("321746","stud114","Career Mpya" ,"0741367812",20,"Male"),
("390234","stud115","Deamon Anduro" ,"0744421123",22,"Female");

 * sqlite:///stud_db
15 rows affected.

[]

In [ ]:
%%sql
CREATE TABLE school_details(stud_ID VARCHAR(15), current_home_county VARCHAR(20),
secondary_school_county VARCHAR(20), residence VARCHAR(15), stud_email VARCHAR(50),
PRIMARY KEY (stud_ID)  );

 * sqlite:///stud_db
Done.

[]

In [ ]:
%%sql
INSERT INTO school_details(stud_ID)
SELECT stud_ID
FROM personal_details;

 * sqlite:///stud_db
15 rows affected.

[]

In [ ]:
%%sql UPDATE school_details
SET stud_email = (SELECT REPLACE (stud_name,' ','')||'@zinduaschool.ac'
					FROM personal_details
					WHERE school_details.stud_ID = personal_details.stud_ID);

 * sqlite:///stud_db
15 rows affected.

[]

In [ ]:
%%sql
UPDATE school_details SET current_home_county="Nakuru", secondary_school_county="Nairobi", residence="In school" WHERE stud_ID="stud101";
UPDATE school_details SET current_home_county="Nairobi", secondary_school_county="Nakuru", residence="In school" WHERE stud_ID="stud102";
UPDATE school_details SET current_home_county="Samburu", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud103";
UPDATE school_details SET current_home_county="Kericho", secondary_school_county="Nairobi", residence="In school" WHERE stud_ID="stud104";
UPDATE school_details SET current_home_county="Nyamira", secondary_school_county="Nakuru", residence="In school" WHERE stud_ID="stud105";
UPDATE school_details SET current_home_county="Kisumu", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud106";
UPDATE school_details SET current_home_county="Nakuru", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud107";
UPDATE school_details SET current_home_county="Kisumu", secondary_school_county="Mombasa", residence="Out of school" WHERE stud_ID="stud108";
UPDATE school_details SET current_home_county="Kericho", secondary_school_county="Mombasa", residence="In school" WHERE stud_ID="stud109";
UPDATE school_details SET current_home_county="Nakuru", secondary_school_county="Mombasa", residence="In school" WHERE stud_ID="stud110";
UPDATE school_details SET current_home_county="Kiambu", secondary_school_county="Turkana", residence="In school" WHERE stud_ID="stud111";
UPDATE school_details SET current_home_county="Nairobi", secondary_school_county="Nakuru", residence="In school" WHERE stud_ID="stud112";
UPDATE school_details SET current_home_county="Samburu", secondary_school_county="Taita Taveta", residence="In school" WHERE stud_ID="stud113";
UPDATE school_details SET current_home_county="Kericho", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud114";
UPDATE school_details SET current_home_county="Kiambu", secondary_school_county="Mombasa", residence="In school" WHERE stud_ID="stud115";

 * sqlite:///stud_db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%sql CREATE TABLE contact_details (stud_email VARCHAR(50) , phone_number VARCHAR(15), next_of_kin_name VARCHAR(50),next_of_kin_relation VARCHAR(10), next_of_kin_contacts VARCHAR(13) );

 * sqlite:///stud_db
Done.

[]

In [ ]:
%%sql
INSERT INTO contact_details(phone_number, next_of_kin_name,next_of_kin_relation,next_of_kin_contacts)
VALUES("0712345678","Darius Young","Father","0782382383"),
("0723456781","Lucy Nderitu","Mother","0723238983"),
("0734567812","Jerotich Koech","Mother","0779343126"),
("0745678123","Mwaura Mwangi","Father","0798246347"),
("0756781234","Ian Patrick","Father","0711234453"),
("0767812345","Lebron James","Father","0765439233"),
("0778123456","Magna Carter","Father","0702526243"),
("0781234567","Cindy Wayne","Mother","0747282839"),
("0722345678","Farah Maalim","Mother","0753927482"),
("0733456781","Faiba Mbugua","Father","0713245748"),
("0744567812","John Doe","Father","0725737383"),
("0755678123","Klaus Michealson","Father","0789346276"),
("0766456781","Suluhu Amdany","Mother","0785739259"),
("0741367812","Daisy Auma","Mother","0791344537"),
("0755421123","Getrude Karen","Mother","0765748244");

 * sqlite:///stud_db
15 rows affected.

[]

In [ ]:
%%sql

UPDATE contact_details
SET stud_email = (SELECT school_details.stud_email
FROM school_details, personal_details
WHERE school_details.stud_ID = personal_details.stud_ID
AND personal_details.phone_number = contact_details.phone_number);

 * sqlite:///stud_db
15 rows affected.

[]

In [ ]:
%%sql
ALTER TABLE contact_details
MODIFY stud_email VARCHAR(50) PRIMARY KEY ;

 * sqlite:///stud_db
(sqlite3.OperationalError) near "MODIFY": syntax error
[SQL: ALTER TABLE contact_details
MODIFY stud_email VARCHAR(50) PRIMARY KEY ;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [ ]:
%%sql
CREATE TABLE financial_details (stud_ID VARCHAR(15) ,stud_name VARCHAR(50) ,
sem_fee INTEGER(6) , fee_paid INTEGER(6),
PRIMARY KEY(stud_ID) );

 * sqlite:///stud_db
Done.

[]

In [ ]:
%%sql
INSERT INTO financial_details(stud_ID,stud_name)
SELECT personal_details.stud_ID, personal_details.stud_name
FROM personal_details;

 * sqlite:///stud_db
15 rows affected.

[]

In [ ]:
%%sql
UPDATE financial_details SET sem_fee = 25000, fee_paid=25000 WHERE stud_ID = "stud101";
UPDATE financial_details SET sem_fee= 25000, fee_paid=19000 WHERE stud_ID = "stud102";
UPDATE financial_details SET sem_fee= 21900, fee_paid=20000 WHERE stud_ID = "stud103";
UPDATE financial_details SET sem_fee= 22000, fee_paid=22000 WHERE stud_ID = "stud104";
UPDATE financial_details SET sem_fee= 25000, fee_paid=23400 WHERE stud_ID = "stud105";
UPDATE financial_details SET sem_fee= 25000, fee_paid=27000 WHERE stud_ID = "stud106";
UPDATE financial_details SET sem_fee= 24230, fee_paid=21200 WHERE stud_ID = "stud107";
UPDATE financial_details SET sem_fee= 25000, fee_paid=23500 WHERE stud_ID = "stud108";
UPDATE financial_details SET sem_fee= 25000, fee_paid=24500 WHERE stud_ID = "stud109";
UPDATE financial_details SET sem_fee= 25000, fee_paid=25000 WHERE stud_ID = "stud110";
UPDATE financial_details SET sem_fee= 26000, fee_paid=26000 WHERE stud_ID = "stud111";
UPDATE financial_details SET sem_fee= 25000, fee_paid=20900 WHERE stud_ID = "stud112";
UPDATE financial_details SET sem_fee= 25000, fee_paid=22300 WHERE stud_ID = "stud113";
UPDATE financial_details SET sem_fee= 19000, fee_paid=19000 WHERE stud_ID = "stud114";
UPDATE financial_details SET sem_fee= 20800, fee_paid=20800 WHERE stud_ID = "stud115";

 * sqlite:///stud_db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%sql SET SQL_SAFE_UPDATES =1;

 * sqlite:///stud_db
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET SQL_SAFE_UPDATES =1;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [ ]:
%sql SELECT * FROM financial_details;

 * sqlite:///stud_db
Done.

[('stud101', 'Hermione Granger', 25000, 25000, None),
 ('stud102', 'Draco Malfo', 25000, 19000, None),
 ('stud103', 'Jayden Wamashati', 21900, 20000, None),
 ('stud104', 'Ron Weasley', 22000, 22000, None),
 ('stud105', 'Dolores Umbridge', 25000, 23400, None),
 ('stud106', 'Hedwig Tonks', 25000, 27000, None),
 ('stud107', 'Chao Chang', 24230, 21200, None),
 ('stud108', 'Curfew Yaeitpm', 25000, 23500, None),
 ('stud109', 'Chaptr Mukenya', 25000, 24500, None),
 ('stud110', 'Natalie Mpema', 25000, 25000, None),
 ('stud111', 'Crew Nundi', 26000, 26000, None),
 ('stud112', 'Bandi Kagunda', 25000, 20900, None),
 ('stud113', 'Testimony Omolo', 25000, 22300, None),
 ('stud114', 'Career Mpya', 19000, 19000, None),
 ('stud115', 'Deamon Anduro', 20800, 20800, None)]

In [ ]:
%sql SELECT * FROM contact_details;

 * sqlite:///stud_db
Done.

[(None, '0712345678', 'Darius Young', 'Father', '0782382383'),
 (None, '0723456781', 'Lucy Nderitu', 'Mother', '0723238983'),
 (None, '0734567812', 'Jerotich Koech', 'Mother', '0779343126'),
 (None, '0745678123', 'Mwaura Mwangi', 'Father', '0798246347'),
 (None, '0756781234', 'Ian Patrick', 'Father', '0711234453'),
 (None, '0767812345', 'Lebron James', 'Father', '0765439233'),
 (None, '0778123456', 'Magna Carter', 'Father', '0702526243'),
 (None, '0781234567', 'Cindy Wayne', 'Mother', '0747282839'),
 (None, '0722345678', 'Farah Maalim', 'Mother', '0753927482'),
 (None, '0733456781', 'Faiba Mbugua', 'Father', '0713245748'),
 (None, '0744567812', 'John Doe', 'Father', '0725737383'),
 (None, '0755678123', 'Klaus Michealson', 'Father', '0789346276'),
 (None, '0766456781', 'Suluhu Amdany', 'Mother', '0785739259'),
 (None, '0741367812', 'Daisy Auma', 'Mother', '0791344537'),
 (None, '0755421123', 'Getrude Karen', 'Mother', '0765748244')]

1.Using JOIN get the student names, school id, email, phone number (new_stud_details).

In [73]:
%%sql
SELECT personal_details.stud_name AS Student_Name, school_details.stud_ID AS School_ID, school_details.stud_email AS Email, contact_details.phone_number AS Phone_Number
FROM personal_details
INNER JOIN school_details ON personal_details.stud_ID = school_details.stud_ID
INNER JOIN contact_details ON personal_details.phone_number = contact_details.phone_number;

 * sqlite:///stud_db
Done.

[('Hermione Granger', 'stud101', 'HermioneGranger@zinduaschool.ac', '0712345678'),
 ('Draco Malfo', 'stud102', 'DracoMalfo@zinduaschool.ac', '0723456781'),
 ('Jayden Wamashati', 'stud103', 'JaydenWamashati@zinduaschool.ac', '0734567812'),
 ('Ron Weasley', 'stud104', 'RonWeasley@zinduaschool.ac', '0745678123'),
 ('Dolores Umbridge', 'stud105', 'DoloresUmbridge@zinduaschool.ac', '0756781234'),
 ('Hedwig Tonks', 'stud106', 'HedwigTonks@zinduaschool.ac', '0767812345'),
 ('Chao Chang', 'stud107', 'ChaoChang@zinduaschool.ac', '0778123456'),
 ('Curfew Yaeitpm', 'stud108', 'CurfewYaeitpm@zinduaschool.ac', '0781234567'),
 ('Chaptr Mukenya', 'stud109', 'ChaptrMukenya@zinduaschool.ac', '0722345678'),
 ('Natalie Mpema', 'stud110', 'NatalieMpema@zinduaschool.ac', '0733456781'),
 ('Crew Nundi', 'stud111', 'CrewNundi@zinduaschool.ac', '0744567812'),
 ('Bandi Kagunda', 'stud112', 'BandiKagunda@zinduaschool.ac', '0755678123'),
 ('Testimony Omolo', 'stud113', 'TestimonyOmolo@zinduaschool.ac', '0766456781'),
 ('Career Mpya', 'stud114', 'CareerMpya@zinduaschool.ac', '0741367812')]

2. Create a table with all the details from contacts to school and financial details (full_stud_details)

In [75]:
%%sql
CREATE TABLE full_stud_details AS
SELECT * FROM personal_details
INNER JOIN school_details ON personal_details.stud_ID = school_details.stud_ID
INNER JOIN contact_details ON personal_details.phone_number = contact_details.phone_number
INNER JOIN financial_details ON personal_details.stud_ID = financial_details.stud_ID;

 * sqlite:///stud_db
(sqlite3.OperationalError) table full_stud_details already exists
[SQL: CREATE TABLE full_stud_details AS
SELECT * FROM personal_details
INNER JOIN school_details ON personal_details.stud_ID = school_details.stud_ID
INNER JOIN contact_details ON personal_details.phone_number = contact_details.phone_number
INNER JOIN financial_details ON personal_details.stud_ID = financial_details.stud_ID;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [76]:
%%sql
SELECT * FROM full_stud_details;

 * sqlite:///stud_db
Done.

[(344534, 'stud101', 'Hermione Granger', '0712345678', 20, 'Male', 'stud101', 'Nakuru', 'Nairobi', 'In school', 'HermioneGranger@zinduaschool.ac', None, '0712345678', 'Darius Young', 'Father', '0782382383', 'stud101', 'Hermione Granger', 25000, 25000, 1),
 (379683, 'stud102', 'Draco Malfo', '0723456781', 21, 'Female', 'stud102', 'Nairobi', 'Nakuru', 'In school', 'DracoMalfo@zinduaschool.ac', None, '0723456781', 'Lucy Nderitu', 'Mother', '0723238983', 'stud102', 'Draco Malfo', 25000, 19000, 0),
 (347403, 'stud103', 'Jayden Wamashati', '0734567812', 22, 'Male', 'stud103', 'Samburu', 'Nairobi', 'Out of school', 'JaydenWamashati@zinduaschool.ac', None, '0734567812', 'Jerotich Koech', 'Mother', '0779343126', 'stud103', 'Jayden Wamashati', 21900, 20000, 0),
 (377302, 'stud104', 'Ron Weasley', '0745678123', 19, 'Female', 'stud104', 'Kericho', 'Nairobi', 'In school', 'RonWeasley@zinduaschool.ac', None, '0745678123', 'Mwaura Mwangi', 'Father', '0798246347', 'stud104', 'Ron Weasley', 22000, 22000, 1),
 (336741, 'stud105', 'Dolores Umbridge', '0756781234', 21, 'Male', 'stud105', 'Nyamira', 'Nakuru', 'In school', 'DoloresUmbridge@zinduaschool.ac', None, '0756781234', 'Ian Patrick', 'Father', '0711234453', 'stud105', 'Dolores Umbridge', 25000, 23400, 0),
 (307243, 'stud106', 'Hedwig Tonks', '0767812345', 21, 'Female', 'stud106', 'Kisumu', 'Nairobi', 'Out of school', 'HedwigTonks@zinduaschool.ac', None, '0767812345', 'Lebron James', 'Father', '0765439233', 'stud106', 'Hedwig Tonks', 25000, 27000, 0),
 (310932, 'stud107', 'Chao Chang', '0778123456', 22, 'Male', 'stud107', 'Nakuru', 'Nairobi', 'Out of school', 'ChaoChang@zinduaschool.ac', None, '0778123456', 'Magna Carter', 'Father', '0702526243', 'stud107', 'Chao Chang', 24230, 21200, 0),
 (343920, 'stud108', 'Curfew Yaeitpm', '0781234567', 20, 'Female', 'stud108', 'Kisumu', 'Mombasa', 'Out of school', 'CurfewYaeitpm@zinduaschool.ac', None, '0781234567', 'Cindy Wayne', 'Mother', '0747282839', 'stud108', 'Curfew Yaeitpm', 25000, 23500, 0),
 (345261, 'stud109', 'Chaptr Mukenya', '0722345678', 20, 'Male', 'stud109', 'Kericho', 'Mombasa', 'In school', 'ChaptrMukenya@zinduaschool.ac', None, '0722345678', 'Farah Maalim', 'Mother', '0753927482', 'stud109', 'Chaptr Mukenya', 25000, 24500, 0),
 (339152, 'stud110', 'Natalie Mpema', '0733456781', 21, 'Female', 'stud110', 'Nakuru', 'Mombasa', 'In school', 'NatalieMpema@zinduaschool.ac', None, '0733456781', 'Faiba Mbugua', 'Father', '0713245748', 'stud110', 'Natalie Mpema', 25000, 25000, 1),
 (339746, 'stud111', 'Crew Nundi', '0744567812', 20, 'Male', 'stud111', 'Kiambu', 'Turkana', 'In school', 'CrewNundi@zinduaschool.ac', None, '0744567812', 'John Doe', 'Father', '0725737383', 'stud111', 'Crew Nundi', 26000, 26000, 1),
 (336373, 'stud112', 'Bandi Kagunda', '0755678123', 22, 'Female', 'stud112', 'Nairobi', 'Nakuru', 'In school', 'BandiKagunda@zinduaschool.ac', None, '0755678123', 'Klaus Michealson', 'Father', '0789346276', 'stud112', 'Bandi Kagunda', 25000, 20900, 0),
 (325252, 'stud113', 'Testimony Omolo', '0766456781', 21, 'Male', 'stud113', 'Samburu', 'Taita Taveta', 'In school', 'TestimonyOmolo@zinduaschool.ac', None, '0766456781', 'Suluhu Amdany', 'Mother', '0785739259', 'stud113', 'Testimony Omolo', 25000, 22300, 0),
 (321746, 'stud114', 'Career Mpya', '0741367812', 20, 'Male', 'stud114', 'Kericho', 'Nairobi', 'Out of school', 'CareerMpya@zinduaschool.ac', None, '0741367812', 'Daisy Auma', 'Mother', '0791344537', 'stud114', 'Career Mpya', 19000, 19000, 1)]

In [79]:
%%sql
SELECT *FROM full_stud_details LIMIT 10;

 * sqlite:///stud_db
Done.

[(344534, 'stud101', 'Hermione Granger', '0712345678', 20, 'Male', 'stud101', 'Nakuru', 'Nairobi', 'In school', 'HermioneGranger@zinduaschool.ac', None, '0712345678', 'Darius Young', 'Father', '0782382383', 'stud101', 'Hermione Granger', 25000, 25000, 1),
 (379683, 'stud102', 'Draco Malfo', '0723456781', 21, 'Female', 'stud102', 'Nairobi', 'Nakuru', 'In school', 'DracoMalfo@zinduaschool.ac', None, '0723456781', 'Lucy Nderitu', 'Mother', '0723238983', 'stud102', 'Draco Malfo', 25000, 19000, 0),
 (347403, 'stud103', 'Jayden Wamashati', '0734567812', 22, 'Male', 'stud103', 'Samburu', 'Nairobi', 'Out of school', 'JaydenWamashati@zinduaschool.ac', None, '0734567812', 'Jerotich Koech', 'Mother', '0779343126', 'stud103', 'Jayden Wamashati', 21900, 20000, 0),
 (377302, 'stud104', 'Ron Weasley', '0745678123', 19, 'Female', 'stud104', 'Kericho', 'Nairobi', 'In school', 'RonWeasley@zinduaschool.ac', None, '0745678123', 'Mwaura Mwangi', 'Father', '0798246347', 'stud104', 'Ron Weasley', 22000, 22000, 1),
 (336741, 'stud105', 'Dolores Umbridge', '0756781234', 21, 'Male', 'stud105', 'Nyamira', 'Nakuru', 'In school', 'DoloresUmbridge@zinduaschool.ac', None, '0756781234', 'Ian Patrick', 'Father', '0711234453', 'stud105', 'Dolores Umbridge', 25000, 23400, 0),
 (307243, 'stud106', 'Hedwig Tonks', '0767812345', 21, 'Female', 'stud106', 'Kisumu', 'Nairobi', 'Out of school', 'HedwigTonks@zinduaschool.ac', None, '0767812345', 'Lebron James', 'Father', '0765439233', 'stud106', 'Hedwig Tonks', 25000, 27000, 0),
 (310932, 'stud107', 'Chao Chang', '0778123456', 22, 'Male', 'stud107', 'Nakuru', 'Nairobi', 'Out of school', 'ChaoChang@zinduaschool.ac', None, '0778123456', 'Magna Carter', 'Father', '0702526243', 'stud107', 'Chao Chang', 24230, 21200, 0),
 (343920, 'stud108', 'Curfew Yaeitpm', '0781234567', 20, 'Female', 'stud108', 'Kisumu', 'Mombasa', 'Out of school', 'CurfewYaeitpm@zinduaschool.ac', None, '0781234567', 'Cindy Wayne', 'Mother', '0747282839', 'stud108', 'Curfew Yaeitpm', 25000, 23500, 0),
 (345261, 'stud109', 'Chaptr Mukenya', '0722345678', 20, 'Male', 'stud109', 'Kericho', 'Mombasa', 'In school', 'ChaptrMukenya@zinduaschool.ac', None, '0722345678', 'Farah Maalim', 'Mother', '0753927482', 'stud109', 'Chaptr Mukenya', 25000, 24500, 0),
 (339152, 'stud110', 'Natalie Mpema', '0733456781', 21, 'Female', 'stud110', 'Nakuru', 'Mombasa', 'In school', 'NatalieMpema@zinduaschool.ac', None, '0733456781', 'Faiba Mbugua', 'Father', '0713245748', 'stud110', 'Natalie Mpema', 25000, 25000, 1)]

3. Add student names on any empty row of stud_name in financial_details

In [80]:
%%sql
UPDATE financial_details
SET stud_name = (SELECT personal_details.stud_name
FROM personal_details
WHERE personal_details.stud_ID = financial_details.stud_ID)
WHERE financial_details.stud_name IS NULL;

 * sqlite:///stud_db
0 rows affected.

[]

In [82]:
%%sql
SELECT * FROM financial_details;

 * sqlite:///stud_db
Done.

[('stud101', 'Hermione Granger', 25000, 25000, 1),
 ('stud102', 'Draco Malfo', 25000, 19000, 0),
 ('stud103', 'Jayden Wamashati', 21900, 20000, 0),
 ('stud104', 'Ron Weasley', 22000, 22000, 1),
 ('stud105', 'Dolores Umbridge', 25000, 23400, 0),
 ('stud106', 'Hedwig Tonks', 25000, 27000, 0),
 ('stud107', 'Chao Chang', 24230, 21200, 0),
 ('stud108', 'Curfew Yaeitpm', 25000, 23500, 0),
 ('stud109', 'Chaptr Mukenya', 25000, 24500, 0),
 ('stud110', 'Natalie Mpema', 25000, 25000, 1),
 ('stud111', 'Crew Nundi', 26000, 26000, 1),
 ('stud112', 'Bandi Kagunda', 25000, 20900, 0),
 ('stud113', 'Testimony Omolo', 25000, 22300, 0),
 ('stud114', 'Career Mpya', 19000, 19000, 1),
 ('stud115', 'Deamon Anduro', 20800, 20800, 1)]

4. On the financial_details table add a column, fee_cleared, that has True if student has cleared current fee and False if not (financial_details_view)

In [ ]:
%%sql
ALTER TABLE financial_details
ADD COLUMN fee_cleared BOOLEAN;

 * sqlite:///stud_db
Done.

[]

In [ ]:
%%sql
UPDATE financial_details
SET fee_cleared = TRUE
WHERE sem_fee = fee_paid;

UPDATE financial_details
SET fee_cleared = FALSE
WHERE sem_fee <> fee_paid;

 * sqlite:///stud_db
6 rows affected.
9 rows affected.

[]

In [ ]:
%sql select * from financial_details AS financial_details_view;

 * sqlite:///stud_db
Done.

[('stud101', 'Hermione Granger', 25000, 25000, 1),
 ('stud102', 'Draco Malfo', 25000, 19000, 0),
 ('stud103', 'Jayden Wamashati', 21900, 20000, 0),
 ('stud104', 'Ron Weasley', 22000, 22000, 1),
 ('stud105', 'Dolores Umbridge', 25000, 23400, 0),
 ('stud106', 'Hedwig Tonks', 25000, 27000, 0),
 ('stud107', 'Chao Chang', 24230, 21200, 0),
 ('stud108', 'Curfew Yaeitpm', 25000, 23500, 0),
 ('stud109', 'Chaptr Mukenya', 25000, 24500, 0),
 ('stud110', 'Natalie Mpema', 25000, 25000, 1),
 ('stud111', 'Crew Nundi', 26000, 26000, 1),
 ('stud112', 'Bandi Kagunda', 25000, 20900, 0),
 ('stud113', 'Testimony Omolo', 25000, 22300, 0),
 ('stud114', 'Career Mpya', 19000, 19000, 1),
 ('stud115', 'Deamon Anduro', 20800, 20800, 1)]

5. Get the national ID and name of all students who have cleared their fees (fee_cleared)

In [ ]:
%%sql
SELECT personal_details.stud_ID, personal_details.stud_name FROM personal_details
WHERE personal_details.stud_ID IN
(SELECT financial_details.stud_ID FROM financial_details
WHERE financial_details.fee_cleared = 1);

 * sqlite:///stud_db
Done.

[('stud101', 'Hermione Granger'),
 ('stud104', 'Ron Weasley'),
 ('stud110', 'Natalie Mpema'),
 ('stud111', 'Crew Nundi'),
 ('stud114', 'Career Mpya'),
 ('stud115', 'Deamon Anduro')]

6. Get the total sum of fees paid so far and the total current deficit (total_fee_balance)

In [ ]:
%%sql
SELECT SUM(fee_paid) FROM financial_details;

 * sqlite:///stud_db
Done.

[(339600,)]

In [ ]:
%%sql
SELECT SUM(fee_paid),
       SUM(sem_fee) - SUM(fee_paid) AS total_deficit FROM financial_details;

 * sqlite:///stud_db
Done.

[(339600, 19330)]

7. Get the count of students who share a current home county i.e., Say Nairobi, get the number of students who’s current_home_county is Nairobi, and so on for all available counties (home_county_count)

In [46]:
%%sql
SELECT COUNT(stud_ID) FROM school_details WHERE current_home_county = "Nairobi";

 * sqlite:///stud_db
Done.

[(2,)]

In [48]:
%%sql
SELECT COUNT(stud_ID) FROM school_details WHERE current_home_county = "Nakuru";

 * sqlite:///stud_db
Done.

[(3,)]

In [49]:
%%sql
SELECT COUNT(stud_ID) FROM school_details WHERE current_home_county = "Samburu";

 * sqlite:///stud_db
Done.

[(2,)]

In [50]:
%%sql
SELECT COUNT(stud_ID) FROM school_details WHERE current_home_county = "Kericho";

 * sqlite:///stud_db
Done.

[(3,)]

In [51]:
%%sql
SELECT COUNT(stud_ID) FROM school_details WHERE current_home_county = "Nyamira";

 * sqlite:///stud_db
Done.

[(1,)]

In [52]:
%%sql
SELECT COUNT(stud_ID) FROM school_details WHERE current_home_county = "Kisumu";

 * sqlite:///stud_db
Done.

[(2,)]

In [53]:
%%sql
SELECT COUNT(stud_ID) FROM school_details WHERE current_home_county = "Kiambu";

 * sqlite:///stud_db
Done.

[(2,)]

In [55]:
%%sql
SELECT COUNT(stud_ID), current_home_county FROM school_details GROUP BY current_home_county;

 * sqlite:///stud_db
Done.

[(3, 'Kericho'),
 (2, 'Kiambu'),
 (2, 'Kisumu'),
 (2, 'Nairobi'),
 (3, 'Nakuru'),
 (1, 'Nyamira'),
 (2, 'Samburu')]

8. Get the count of Male and/or Female students from each secondary_school_county (secondary_school_count). The table should contain a column for male student count and female student count for each county.

In [59]:
%%sql
SELECT secondary_school_county, COUNT(CASE WHEN gender = 'Male' THEN 1 END) AS MALE, COUNT(CASE WHEN gender = 'Female' THEN 1 END) AS FEMALE FROM personal_details
INNER JOIN school_details ON personal_details.stud_ID = school_details.stud_ID
GROUP BY secondary_school_county;

 * sqlite:///stud_db
Done.

[('Mombasa', 1, 3),
 ('Nairobi', 4, 2),
 ('Nakuru', 1, 2),
 ('Taita Taveta', 1, 0),
 ('Turkana', 1, 0)]

9. Get the percentage of students who set their next_of_kin as Mother vs those that set it as Father1. (kin_percentage)

In [71]:
%%sql
SELECT
    COUNT(CASE WHEN next_of_kin_relation = 'Mother' THEN 1 END) * 100.0 / COUNT(*) AS mother_percentage,
    COUNT(CASE WHEN next_of_kin_relation = 'Father' THEN 1 END) * 100.0 / COUNT(*) AS father_percentage
FROM contact_details;

 * sqlite:///stud_db
Done.

[(46.666666666666664, 53.333333333333336)]